<a href="https://colab.research.google.com/github/kristi-thinkful/thinkful-solutions/blob/master/python_III_pandas/manipulating_dataframes.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
# this code allows the display of output from multiple calls without requiring print() each time
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

import pandas as pd
import warnings
warnings.filterwarnings("ignore")

## kickstarter
This is a dataset consisting of statistics about Kickstarter projects. Download the dataset [here](https://tf-assets-prod.s3.amazonaws.com/tf-curric/data-science/ksprojects.csv). Create a DataFrame from the table named ksprojects. Write code that allows you to answer the following questions. Create a separate cell for each question.

1. How many rows of data are in the DataFrame?
2. What are the names and data types of the columns?
3. Do any of the columns contain null values?
4. Find all successful documentary projects and sort them by the amount pledged. Print the top 10 highest pledges.
5. Create a new column named average_per_backer and set its value to the total amount pledged / number of backers. What happened to the rows with 0 backers? How can this be dealt with?
7. Drop all rows with 0 backers then repeat the previous exercise.
8. Create a crosstab to get a count of records for each combination of state and category.

####**Load data**

In [2]:
kickstarter_url = 'https://raw.githubusercontent.com/kristi-thinkful/thinkful-solutions/master/python_III_pandas/data/ksprojects.csv'
kickstarter = pd.read_csv(kickstarter_url)
kickstarter.head()

           id  ...  pledged
0  1147015301  ...    40.00
1  1100844465  ...   700.00
2  1316334968  ...  1367.00
3  1304906577  ...  6575.00
4  1099226462  ...   501.66

[5 rows x 13 columns]

####**1. How many rows of data are in the DataFrame?**

In [3]:
print('There are {} rows in the kickstarter dataset.'.format(kickstarter.shape[0]))

There are 65418 rows in the kickstarter dataset.

####**2. What are the names and data types of the columns?**

In [4]:
print('The column names are:\n', pd.Series(kickstarter.columns))

The column names are:
 0                id
1              name
2          category
3     main_category
4          deadline
5              goal
6          launched
7             state
8           backers
9           country
10      usd_pledged
11         currency
12          pledged
dtype: object

####**3. Do any of the columns contain null values?**

In [5]:
kickstarter.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 65418 entries, 0 to 65417
Data columns (total 13 columns):
id               65418 non-null int64
name             65418 non-null object
category         65418 non-null object
main_category    65418 non-null object
deadline         65418 non-null object
goal             65418 non-null float64
launched         65418 non-null object
state            65418 non-null object
backers          65418 non-null int64
country          65418 non-null object
usd_pledged      64673 non-null float64
currency         65418 non-null object
pledged          65418 non-null float64
dtypes: float64(3), int64(2), object(8)
memory usage: 6.5+ MB

The only column with missing values is usd_pledged.

####**4. Find all successful documentary projects and sort them by the amount pledged. Print the top 10 highest pledges.**

In [6]:
successful_documentaries = (kickstarter['category'] == 'Documentary') & (kickstarter['state'] == 'successful')
top_docs = kickstarter.iloc[successful_documentaries.values, [1, 2, 5, 7, 8, 9, 10]].sort_values(by = 'usd_pledged', ascending = False)[:10]
top_docs.index = [str(i) for i in range(1, 11)]
top_docs

                                                 name  ... usd_pledged
1                 BRIDEGROOM - An American Love Story  ...    384376.0
2   "The Wrecking Crew" The Untold Story of Rock &...  ...    313158.0
3                           The Killing of Tony Blair  ...    255150.0
4                                    The Culture High  ...    240022.0
5                                      ILEANA'S SMILE  ...    177421.0
6                              Rewind To Fast-Forward  ...    176746.0
7                                Linsanity: the Movie  ...    167917.0
8                   El Voto Hispano | The Documentary  ...    165401.0
9   PlantPure Nation, a Documentary with Dr. T. Co...  ...    163930.0
10                                   BREXIT THE MOVIE  ...    162393.0

[10 rows x 7 columns]

####**5. Create a new column named average_per_backer and set its value to the total amount pledged / number of backers. What happened to the rows with 0 backers? How can this be dealt with?**

In [16]:
kickstarter['average_per_backer'] = kickstarter['usd_pledged'] / kickstarter['backers']
kickstarter

               id  ... average_per_backer
0      1147015301  ...          10.000000
1      1100844465  ...          50.000000
2      1316334968  ...          42.718750
3      1304906577  ...         273.958333
4      1099226462  ...          22.802727
...           ...  ...                ...
65413  1107492255  ...         113.568889
65414  1373187022  ...          36.986486
65415  1212504494  ...                NaN
65416  1347446277  ...                NaN
65417  1075208929  ...                NaN

[65418 rows x 14 columns]

The resulting column has introduced NaNs where backers = 0. We could fix this with an if/else statement.

In [19]:
# initialize, don't grow lists, arrays, or series
kickstarter['average_per_backer'] = 0
non_zero_backers = kickstarter['backers'] != 0
kickstarter['average_per_backer'][non_zero_backers] = kickstarter['usd_pledged'] / kickstarter['backers']
kickstarter

               id  ... average_per_backer
0      1147015301  ...          10.000000
1      1100844465  ...          50.000000
2      1316334968  ...          42.718750
3      1304906577  ...         273.958333
4      1099226462  ...          22.802727
...           ...  ...                ...
65413  1107492255  ...         113.568889
65414  1373187022  ...          36.986486
65415  1212504494  ...           0.000000
65416  1347446277  ...           0.000000
65417  1075208929  ...           0.000000

[65418 rows x 14 columns]


####**6. Drop all rows with 0 backers then repeat the previous exercise.**

In [20]:
# drop column from previous exercise
del kickstarter['average_per_backer']
kickstarter_drop_zero_backers = kickstarter[kickstarter['backers'] != 0]
kickstarter_drop_zero_backers.head()

           id  ...  pledged
0  1147015301  ...    40.00
1  1100844465  ...   700.00
2  1316334968  ...  1367.00
3  1304906577  ...  6575.00
4  1099226462  ...   501.66

[5 rows x 13 columns]

In [21]:
kickstarter_drop_zero_backers['average_per_backer'] = kickstarter['usd_pledged'] / kickstarter['backers']
kickstarter_drop_zero_backers.head()

           id  ... average_per_backer
0  1147015301  ...          10.000000
1  1100844465  ...          50.000000
2  1316334968  ...          42.718750
3  1304906577  ...         273.958333
4  1099226462  ...          22.802727

[5 rows x 14 columns]

####**7. Create a crosstab to get a count of records for each combination of state and category.**

In [11]:
pd.crosstab(kickstarter['category'], kickstarter['state'])

state        canceled  failed  live  successful  suspended  undefined
category
3D Printing        17      59     3          43          2          1
Academic           21      86     3          43          4          0
Accessories        48     238    16         121          2          1
Action             14      79     1          16          0          0
Animals             2      31     0          11          1          0
...               ...     ...   ...         ...        ...        ...
Woodworking        10     125     4          38          2          0
Workshops           0      12     1           8          1          0
World Music        31     174     2         168          1          0
Young Adult        16      78     1          23          0          0
Zines               6      26     1          17          0          0

[158 rows x 6 columns]

## nycflights13
This data consists of information about all flights that departed NYC in 2013. Download two datasets: [flights](https://tf-assets-prod.s3.amazonaws.com/tf-curric/data-science/flights.csv) and [airlines](https://tf-assets-prod.s3.amazonaws.com/tf-curric/data-science/airlines.csv).

1. Merge these two DataFrames into a single DataFrame: nycflights13.
2. Are there any missing values in this DataFrame?
If so, drop them.

In [12]:
flights_url = 'https://raw.githubusercontent.com/kristi-thinkful/thinkful-solutions/master/python_III_pandas/data/flights.csv'
airlines_url = 'https://raw.githubusercontent.com/kristi-thinkful/thinkful-solutions/master/python_III_pandas/data/airlines.csv'
flights = pd.read_csv(flights_url)
airlines = pd.read_csv(airlines_url)
flights.head()
airlines.head()

   year  month  day  dep_time  ...  distance  hour  minute            time_hour
0  2013      1    1     517.0  ...      1400     5      15  2013-01-01 05:00:00
1  2013      1    1     533.0  ...      1416     5      29  2013-01-01 05:00:00
2  2013      1    1     542.0  ...      1089     5      40  2013-01-01 05:00:00
3  2013      1    1     544.0  ...      1576     5      45  2013-01-01 05:00:00
4  2013      1    1     554.0  ...       762     6       0  2013-01-01 06:00:00

[5 rows x 19 columns]

  carrier                    name
0      9E       Endeavor Air Inc.
1      AA  American Airlines Inc.
2      AS    Alaska Airlines Inc.
3      B6         JetBlue Airways
4      DL    Delta Air Lines Inc.

####**1. Merge these two DataFrames into a single DataFrame: nycflights13.**

In [22]:
nycflights13 = pd.merge(airlines, flights)
nycflights13.head()

  carrier               name  year  ...  hour  minute            time_hour
0      9E  Endeavor Air Inc.  2013  ...     8      10  2013-01-01 08:00:00
1      9E  Endeavor Air Inc.  2013  ...    15       0  2013-01-01 15:00:00
2      9E  Endeavor Air Inc.  2013  ...    14      55  2013-01-01 14:00:00
3      9E  Endeavor Air Inc.  2013  ...    15       0  2013-01-01 15:00:00
4      9E  Endeavor Air Inc.  2013  ...    15      15  2013-01-01 15:00:00

[5 rows x 20 columns]

####**2. Are there any missing values in this DataFrame? If so, drop them.**

In [23]:
nycflights13.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 336776 entries, 0 to 336775
Data columns (total 20 columns):
carrier           336776 non-null object
name              336776 non-null object
year              336776 non-null int64
month             336776 non-null int64
day               336776 non-null int64
dep_time          328521 non-null float64
sched_dep_time    336776 non-null int64
dep_delay         328521 non-null float64
arr_time          328063 non-null float64
sched_arr_time    336776 non-null int64
arr_delay         327346 non-null float64
flight            336776 non-null int64
tailnum           334264 non-null object
origin            336776 non-null object
dest              336776 non-null object
air_time          327346 non-null float64
distance          336776 non-null int64
hour              336776 non-null int64
minute            336776 non-null int64
time_hour         336776 non-null object
dtypes: float64(5), int64(9), object(6)
memory usage: 54.0+ MB

There are missing values in columns dep_time, dep_delay, arr_time, arr_delay, tailnum, and air_time.

In [28]:
nycflights13.dropna(inplace = True)
nycflights13.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 327346 entries, 0 to 336775
Data columns (total 20 columns):
carrier           327346 non-null object
name              327346 non-null object
year              327346 non-null int64
month             327346 non-null int64
day               327346 non-null int64
dep_time          327346 non-null float64
sched_dep_time    327346 non-null int64
dep_delay         327346 non-null float64
arr_time          327346 non-null float64
sched_arr_time    327346 non-null int64
arr_delay         327346 non-null float64
flight            327346 non-null int64
tailnum           327346 non-null object
origin            327346 non-null object
dest              327346 non-null object
air_time          327346 non-null float64
distance          327346 non-null int64
hour              327346 non-null int64
minute            327346 non-null int64
time_hour         327346 non-null object
dtypes: float64(5), int64(9), object(6)
memory usage: 52.4+ MB

## census
For this portion, download two datasets: [census_population](https://tf-assets-prod.s3.amazonaws.com/tf-curric/data-science/state-populations.csv) and [census_regions](https://tf-assets-prod.s3.amazonaws.com/tf-curric/data-science/census-divisions.csv).

1. Merge these two DataFrames into a single DataFrame called census.
2. Re-shape census so that one column contains all population measures, and another the year attributes.
3. Group the data by year and summarize it.
4. Group the data by region, division and year and summarize it.

In [29]:
census_pop_url = 'https://raw.githubusercontent.com/kristi-thinkful/thinkful-solutions/master/python_III_pandas/data/state-populations.csv'
census_reg_url = 'https://raw.githubusercontent.com/kristi-thinkful/thinkful-solutions/master/python_III_pandas/data/census-divisions.csv'
census_pop = pd.read_csv(census_pop_url)
census_reg = pd.read_csv(census_reg_url)
census_pop.head()
census_reg.head()

        state      2010      2011  ...      2014      2015      2016
0     Alabama   4785492   4799918  ...   4843214   4853875   4863300
1      Alaska    714031    722713  ...    736705    737709    741894
2     Arizona   6408312   6467163  ...   6719993   6817565   6931071
3    Arkansas   2921995   2939493  ...   2966912   2977853   2988248
4  California  37332685  37676861  ...  38680810  38993940  39250017

[5 rows x 8 columns]

           state     region     division
0    Connecticut  Northeast  New England
1          Maine  Northeast  New England
2  Massachusetts  Northeast  New England
3  New Hampshire  Northeast  New England
4   Rhode Island  Northeast  New England

####**1. Merge these two DataFrames into a single DataFrame called census.**

In [30]:
census = pd.merge(census_reg, census_pop)
census.head()

           state     region     division  ...     2014     2015     2016
0    Connecticut  Northeast  New England  ...  3591873  3584730  3576452
1          Maine  Northeast  New England  ...  1330719  1329453  1331479
2  Massachusetts  Northeast  New England  ...  6749911  6784240  6811779
3  New Hampshire  Northeast  New England  ...  1328743  1330111  1334795
4   Rhode Island  Northeast  New England  ...  1054480  1055607  1056426

[5 rows x 10 columns]

####**2. Re-shape census so that one column contains all population measures, and another the year attributes.**

In [32]:
census_long = pd.melt(frame = census, id_vars = ['state', 'region', 'division'], var_name = 'year', value_name = 'population')
census_long.head()

           state     region     division  year  population
0    Connecticut  Northeast  New England  2010     3579899
1          Maine  Northeast  New England  2010     1327730
2  Massachusetts  Northeast  New England  2010     6565524
3  New Hampshire  Northeast  New England  2010     1316872
4   Rhode Island  Northeast  New England  2010     1053337

####**3. Group the data by year and summarize it.**

In [33]:
census_long.groupby(by = ['year']).describe()

     population                              ...
          count          mean           std  ...        50%        75%         max
year                                         ...
2010       51.0  6.065651e+06  6.839536e+06  ...  4348662.0  6654375.0  37332685.0
2011       51.0  6.111046e+06  6.907730e+06  ...  4369354.0  6717221.5  37676861.0
2012       51.0  6.156831e+06  6.974942e+06  ...  4384799.0  6776617.0  38011074.0
2013       51.0  6.200096e+06  7.038774e+06  ...  4400477.0  6837396.0  38335203.0
2014       51.0  6.246342e+06  7.110811e+06  ...  4413057.0  6902053.5  38680810.0
2015       51.0  6.292091e+06  7.181603e+06  ...  4424611.0  6988927.5  38993940.0
2016       51.0  6.335834e+06  7.243849e+06  ...  4436974.0  7109535.5  39250017.0

[7 rows x 8 columns]

####**4. Group the data by region, division and year and summarize it.**

In [34]:
census_long.groupby(by = ['region']).describe()

          population                ...
               count          mean  ...        75%         max
region                              ...
Midwest         84.0  5.625171e+06  ...  7443843.0  12879505.0
Northeast       63.0  6.211900e+06  ...  8930211.0  19747183.0
South          119.0  6.972298e+06  ...  8342479.5  27862596.0
West            91.0  5.716867e+06  ...  5399233.5  39250017.0

[4 rows x 8 columns]